// ДЗ 2: Создать приложение для ВКонтакте, которое загружает список ваших
// друзей и выводит их на страницу в следующем формате:
// Фото, ФИО, Возраст, Дата рождения.
// Друзья должны быть отсортированы по дате рождения в порядке убывания.
// То есть на самом верху списка расположен друг с ближайший датой рождения.
// Использование шаблонизатора приветствуется.
// =============================================================================

// =============================================================================
// VK AppID = 5757533
// =============================================================================

// =============================================================================
// Установка HTTP-сервера:
// 1) npm install http-server -g
// Запуск HTTP-сервера:
// 2) http-server hm2 -p 7777 -a 127.0.0.1
// 3) http://localhost:7777/
// =============================================================================

VK.init(
    {
        apiId: 5757533
    }
);

let loginCallBack = (response) => {
    console.log(response);
    if (response.status === 'connected') {
        console.log('успешная авторизация');
    } else {
        console.log('ошибка авторизации');
    }
} //loginCallBack

VK.Auth.login(loginCallBack);
